<template>
  <div class="history-form">
    <div class="timeline">
      <a-timeline pending=" ">
        <a-timeline-item color="rgb(102, 102, 102)"
          ><a href="#historic">20世纪50年代~1988年</a></a-timeline-item
        >
        <a-timeline-item color="rgb(102, 102, 102)"
          ><a href="#jin">1988年~2001年</a></a-timeline-item
        >
        <a-timeline-item color="rgb(102, 102, 102)"
          ><a href="#fight">2001年~至今</a></a-timeline-item
        >
      </a-timeline>
    </div>
    <div class="content">
      <h3 id="historic">20世纪50年代~1988年</h3>
      <p v-for="(count, index) in firstFormContent" :id="first(index)">
        {{ count }}
      </p>
      <h3 id="jin">1988年~2001年</h3>
      <p v-for="(count, index) in secondFormContent" :id="second(index)">
        {{ count }}
      </p>
      <h3 id="fight">2001年~至今</h3>
      <p v-for="(count, index) in thirdFormContent" :id="third(index)">
        {{ count }}
      </p>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      firstFormContent: [
        "手语是聋人表达思想、进行交际的工具。由于我国地域辽阔，存在众多的地方手语，给聋人之间交流带来了不便。确定规范和统一的手语，对于实现聋人“平等、参与、共享”具有至关重要的作用。从20世纪50年代开始，我国就开始手语的规范和统一工作：",
        "——1959年，当时的中国盲人聋人协会整理修订了《聋人通用手语草图》，报请原内务部、教育部、中国文字改革委员会批准试行，先后共出版了4辑、含2000个手势图示。",
        "——1960年，原内务部、教育部、中国文字改革委员会批转中国盲人聋人协会“关于修订聋人通用手语工作方案”的通知，提出了修订通用手语的原则，即：手语与现实生活相一致的原则、手势与手指字母相结合的原则、手语与口头语、书面语相一致或接近的原则、保持形象化和清晰易辨的原则，要求各地在试行期间应向聋人群众宣传通用手语的重要性，同时，并应说明，推行通用手语并不排除地方手语，两者可以并存。",
        "——1979年，原中国盲人聋人协会在草图的基础上重新绘图，又出版了两辑的《聋人通用手语图》，1982年讨论和制定了640个新词手势动作，并由民政部、教育部、中国文字改革委员会批准试行和推广。",
        "——中国盲人聋人协会联合有关部门先后召开过四次手语工作会议，为制定规范统一的通用手语做准备。",
      ],
      secondFormContent: [
        "1988年，中国残联成立以后又组织专家在原有手语研究的基础上，结合有声语言和手指语的使用，编辑出版了统一规范的《中国手语》，1990年又编辑出版了《中国手语（续）》，这已成为我国手语规范、统一成果的具体体现。",
        "自20世纪80年代以来，在国家制定的历次残疾人事业五年工作纲要中，在国家教育行政部门有关聋教育的文件中，多次提出要推行和使用中国手语，明确以规范统一的《中国手语》作为我国官方推广的通用手语。1991年，民政部、原国家教育委员会、国家语言文字工作委员会、中国残疾人联合会共同下发《关于在全国推广应用〈中国手语〉的通知》（[1991]残联宣字第138号），提出在公共场合、学校教育教学方面必须使用《中国手语》、高校特教专业应将《中国手语》列为教学内容等要求。在这期间，由中国残联和中国聋人协会举办的国家级手语培训班达4期，培训手语翻译数百人。同时，各级残联也举办了不同层次的中国手语培训班，培养了相当数量的手语翻译人员。",
      ],
      thirdFormContent: [
        "——修订《中国手语》。为适应新形势需要，中国残联教育就业部和中国聋人协会于2001年7月，共同委托北京师范大学特殊教育研究中心，组织了由聋协主席、聋人代表、手语专家、聋校教师共同组成的中国手语修订专家小组对原《中国手语》进行修订。整个修订工作，历时近2年，最终于2003年5月完成并出版发行。朴方同志为此题词：“规范中国手语，畅通交流渠道”。",
        "——开展全国性问卷调查。为充分了解各地对手语研究和推广的意见和建议，2004年6月中国残联教育就业部和中国聋人协会又在全国范围进行问卷调查，广泛地征求了特教学校聋生、社会成年聋人、聋校教师、手语翻译以及热心学习手语的健听人对手语研究与推广工作的意见。全国共有27个省、市、自治区参与调查，收回有效问卷5547份，数据收集完毕后对有效问卷进行编码处理，采用SPSS (Statistical Package for the Social Science) 11.5统计软件包进行列联表统计分析。调查数据显示：不同被调查者均认为当前和今后一个时期首要工作为继续解决手语统一和规范问题，特别是手语为教学服务、手语拼打规则研究和手语词汇丰富问题；近80%的被调查者同意将《中国手语》作为全国统一、规范的聋人手语加以推广；有80%的被调查者认为《中国手语》推广存在的主要问题是没有系统培训和宣传不够；被调查者普遍认为将聋校师生作为推广中国手语的重点对象，更有80%被调查者建议在聋校开设手语课程。",
        "——积极推进《中国手语》标准化。经原国家质量技术监督局和国家科技部批准立项，中国手语国家标准于1994年开始研究制定。该研究在中国残联教育就业部和中国聋人协会直接领导下，由中国残联所属的中国康复科学所牵头，组织有关部门、专家共同研制，经历十几年的努力，2005年6月，征求意见稿已初步完成。经中国残联教育就业部和中国聋人协会同意，在全国范围内对《中国手语国家标准》征求意见，省级残联教育就业部和聋人协会组织当地聋人代表、手语研究人员和手语翻译工作者认真讨论，同时，也请专家、残疾人康复标准委员会委员认真研究，提出修改建议。",
        "——研究、编辑部分专业领域手语。随着信息时代的到来，学习计算机和互联网聋人数量日益增多，这对计算机专业手语的研究、编辑提出了要求。2002年初，中国残联教育就业部和中国聋人协会共同委托天津理工学院聋人工学院，根据《中国手语》的编写原则，研究、编辑计算机专业手语，作为《中国手语》的补充。该书已于2004年正式出版，词条总数近1200多条。",
        "中国残联教育就业部和中国聋人协会还分别委托长春大学特殊教育学院和上海市教委教研室研究、编辑美术专业手语和自然科学专业手语，两类专业手语正在进行编辑当中。",
        "——编辑出版《中国手语日常会话》。鉴于学习中国手语的健听人特别是服务行业的工作人员越来越多，2003年7月起，中国残联教育就业部和中国聋人协会组织专家编写《中国手语日常会话》，采取情景对话形式，使健听人更快的学会常用手语，更好地与聋人交流、为聋人服务。已正式出版。",
        "——编辑出版《中国手语培训教材（试用）》 为推广规范、通用的中国手语，为广大聋人创造无障碍交流环境。2006年1月，中国残联教育就业部、中国聋人协会和广州市手语研究会共同组织专家编写出版了《中国手语培训教材（试用）》。",
        "——出版中国《手语视频软件（系列）》 为满足中国手语教学研究与推广工作的需求，2005年5月—2006年6月，中国残联教育就业部、中国聋人协会先后组织专家对郑州市聋人百科信息服务有限责任公司（中国聋人百科网）开发的中国《手语视频软件（系列）》进行并通过了评审。由中国残联教育就业部、中国聋人协会担任监制的中国《手语视频软件（系列）》已于2006年9月正式出版发行，同年11月该软件系列已被国家新闻出版总署列入《“十一五”国家重点电子出版物出版规划》。",
        "——开发研制“中国手语视频资源库” 在中国残联教育就业部的指导和帮助下，郑州市聋人百科信息服务有限责任公司（中国聋人百科网）完成了“中国手语视频资源库”的开发工作。 该资源库的建成对中国手语的学习、研究、考评、竞赛有着积极的推动作用。",
        "——召开手语工作座谈会。2004年4月5日—7日，召开了“关于加强中国手语工作座谈会”，邀请了教育部、国家语委、中国聋协、北京师范大学、天津理工学院聋人工学院、中科院计算所、北京市残联、上海市教委、在京特殊教育学校校长以及社会聋人代表对手语工作进行座谈，与会人员纷纷发表意见，对手语工作提出了很多建议，认为手语工作应从政治的高度加以重视、科学的态度加以研究、客观的角度来满足聋人需要。",
        "——多次举办“中国手语培训班”。中国残联教育就业部和中国聋人协会在20世纪九十年代先后举办过4期全国性培训班，培训对象包括部分聋人协会主席、聋校教师和手语翻译，推广了中国手语。2004年12月在浙江省杭州市举办了“第一期国家级骨干手语翻译培训班”，为建设国家级手语翻译队伍奠定了基础。来自全国29个省、自治区、直辖市和新疆生产建设兵团的残联系统手语工作负责人、手语翻译以及部分聋校教师近90人参加了本次培训班。培训班主要介绍了《中国手语》的修订原则，培训了《国际手语》常用词汇、《计算机专业手语》《中国手语》的新增词、修订词、手语的分类，讲解了由中国科学院计算所开发的《中国手语合成系统软件》等。力图通过培训，培养一支既精通中国手语又擅长国际手语的翻译队伍，以便为国内外聋人朋友提供更好服务，同时也为建设国家级骨干手语翻译人才库做好储备。与此同时，各地也培养了一批具有一定水平的专、兼职手语翻译，据不完全统计，全国有专、兼职手语翻译约3万人（含聋校教师、残疾人工作者、聋人家属、社会热心人士等）。",
        "经过多年的努力，中国手语的研究、推广工作颇具成效，已初步形成“学手语、用手语”的社会氛围。中央电视台、省级电视台和部分地方台开办了手语专栏节目，促进了不同地区聋人之间、聋人与健听人之间的交流。一些地方还成立了地方手语研究机构，如广州市、浙江省、北京市、绍兴市、苏州市、大连市等。中州大学率先在全国开设手语研究专业。中科院计算所等有关科研单位也积极利用计算机技术研发中国手语辅助教学软件。",
      ],
    };
  },
  methods: {
    first(index) {
      return "first" + index;
    },
    second(index) {
      return "second" + index;
    },
    third(index) {
      return "third" + index;
    },
  },
};
</script>
<style scoped>
.history-form {
  width: 80%;
  margin-left: 10%;
  margin-top: 2%;
}

.bgc button {
  margin-top: 20px;
}

a {
  text-decoration: none;
  /* 去除默认的下划线 */
  outline: none;
  /* 去除旧版浏览器的点击后的外虚线框 */
  color: rgb(32, 158, 133);
}

.timeline {
  width: 20%;
  position: fixed;
  top: 200px;
  right: 0px;
}

.content {
  background-color: rgba(248, 239, 230, 0.5);
  width: 80%;
  padding: 7px;
}

h3 {
  margin-top: 7px;
  text-align: left;
  vertical-align: center;
  text-indent: 2em;
  color: rgb(32, 158, 133);
}

p {
  margin: 0;
  text-align: left;
  text-indent: 2em;
  line-height: 24px;
  font-size: 14px;
  font-family: 微软雅黑, "Heiti SC", 黑体, Arial;
  text-size-adjust: 100%;
  word-wrap: break-word;
  outline: 0ch;
  zoom: 1;
  color: rgb(66, 66, 66);
  margin-bottom: 1%;
}

.ant-btn {
  color: rgba(0, 0, 0, 0.5);
  border-color: rgba(0, 0, 0, 0.5);
  float: right;
}

.ant-btn:hover,
.ant-btn:focus {
  color: rgb(32, 158, 133);
  border-color: rgb(32, 158, 133);
}

.el-color-picker {
  height: 22px;
  border-radius: 50px;
}

.el-color-picker__trigger {
  border: none;
  width: 20px;
  height: 20px;
  margin-bottom: 20px;
}

.el-color-picker__color {
  border: none;
}

.el-color-picker__color-inner {
  border-radius: 50px;
}

::selection {
  background: rgb(32, 158, 133);
}

.bgc {
  width: 100%;
  display: flex;
  padding-right: 2%;
  justify-content: flex-end;
  align-items: flex-end;
  flex-direction: column;
}

.bgc button {
  width: 28px;
  height: 28px;
  margin-right: 6px;
}
</style>